{
  "title": "A Thousand Splendid Suns by Khaled Hosseini",
  "content": "Written in the year 2007, this intense Khaled Hosseini novel tells two parallel tales of Afghani women amidst the torn nation of Afghanistan. The story in itself is inextricably linked to the backdrop of historical and political scenario that was happening in Afghanistan. It goes perfectly well with the volatile happenings in their country. From the vulnerable Afghani communist government to the Soviet invasion, to the oppressive rule of Taliban, and then the hope of post-Taliban rebuilding, this tragic story takes us through the violence, abuse, fear, and longing that justifies itself with the tumultuous state of this nation. The story revolves around two women, Mariam and Laila, born 20 years apart, but whose lives are intertwined through the events of the novel. Mariam was 5 years old when she first came to know the meaning of the word ‘harami’ - an illegitimate child. And thus began her heart-rending story with this word always looming at the back of her head, and the forefront of her life. Laila, on the other hand, was born in a well-to-do literate family that offered no obstacle in any of her undertakings. There is a generation gap between both these women, but their rueful story entangles to make perfect sense somewhere down the middle. A Thousand Splendid Suns is a book divided into 4 parts and it spans over a period of 40 years. The writing style of the author makes each line of this book grab your attention to the core. The book tells a fictional tale but when you’re reading it, you will feel how real everything sounds. I loved how Hosseini took great care to never betray the emotional tone of the story to mere melodrama. There is a connection between Indians and Afghanis, both groups being a part of two neighboring countries, which makes itself evident throughout the story. As an Indian reader, you will find how similar both India and Afghanistan are. The prejudices, the backwardness, and the unprogressive - are some things which both these countries share in common. But the extent to which Afghani people have seen plight because of such regressive thinking is incomparable for any of us. Though this book tells an enthralling story, there is the reader’s discretion advised. The plot deals with topics like child marriage, abuse, and the untimely death of loved ones, among many other such topics. When I first read this book it left me feeling depressed for days. There were more than a few passages which left me in deep contemplation after which I was filled with a big sense of gratitude for the life I had. I was so moved by my ignorance of the terrible history of Afghanistan. “A Thousand Splendid Suns” is my favorite book and I would wholeheartedly recommend it to anyone who would like to see their whole perspective on life shift gradually with the run of this book. At the end of reading it, you will be more respectful, you will take better care of your relationships, and for sure you will be filled with a sense of gratitude. I won’t say that this book will leave you feeling happy at the end, but you will definitely be a more thoughtful individual once you read through its pages. It's a stunningly beautiful story of a time which couldn’t have been worse, of innocent people who suffered the cruelty of others and at the end an imperishable love story. “One could not count the moons that shimmer on her roofs, Or the thousand splendid suns that hide behind her walls.”",
  "author": "Jai",
  "slug": "a-thousand-splendid-suns",
  "metadesc": "Written in the year 2007, this intense Khaled Hosseini novel tells two parallel tales of Afghani women amidst the torn nation of Afghanistan."
}
