{
  "title": "Do we become what we read, or do we read what we are?",
  "content": "It’s kind of a pertinent question that I’ve been musing on lately. I first thought of it while I was immersed in Murakami’s Sputnik Sweetheart. Before that, I had read three of his novels, and I was already in awe of his strange and subtle tales. I was on a Murakami reading quest. I wanted to read all of his works and continue to be a part of his surreal realities. With each story, I could feel my reality being subjugated by his tensed and engulfing make-believes. There was also a mutual agreement going on between what I was reading and how I felt. This wasn’t the first time that I chased the voice of an author. In the past, I had been on an author spree with this same devotion. Agatha Christie, Khaled Hosseini, John Green - each of them had been a subject of my fixation at some point. I found a clear resemblance between myself and these author’s signature protagonists during each of these periods. That’s the most important thing that binds a reader to an author - the congruence between the words on paper and the bits of beliefs he holds sacred. This time around, it was Murakami who established such rapport with his slightly dark, melancholic stories. Maybe that’s the kind of place I paralleled to where I could only have trusted a literary genius and his take on the absurdity of quotidian life. I am not as delusional to think of these outlying authors as my friends (not yet); our communication is too one-sided to think of them as someone close. But yes, I do feel fixated when I read those conceited thoughts of the author projected on paper. When I am inside the mythical world of a novel, a part of me can’t wait to see how that story unfolds and see it through to the end. But there’s also a silent, a more cardinal part who wants to build a home in that same world and live through my time with its characters. There’s an unsaid agreement between a reader and an author, one that binds the former to the latter’s fancy depiction. The promise to never let go until he takes us to the end of the story. This is the assurance a reader finds while investing his time in a book. Some stories are left without an ending; thankfully, not the ones in published and appraised novels. And now back to the question: do we become what we read, or do we read what we are? Just like most things in life, the answer to this is not clear. I believe in the theory that we are the average of five people we spend the most time with. If these five people happen to be the characters in a novel or the fancy authors you read on the trot, you inevitably impart some of their traits. Having said that, this is just an opinion, and the answer can only be highly subjective. There are days when I might be a little biased towards the latter argument, but then again, we are not constants; with our ever-changing moods, and desires, and needs, each of us may better resemble a variable. There’s no denying that we become what we feed off of. All the protagonists I’ve read and known still breathe a quiet and sustained breath in me. Their blithe undertakings and strong resolves will continue to influence my own way of upholding in one way or another. Even so, I don’t feel compelled to get started on a story if the characters or the plot are too remote for me. One needs to relate to a story and its characters for a flawless resonance to take place. Those few lines on the back of a book help me to check my harmony with the story. Reading is an effortless and enjoyable undertaking for those who find what they’re looking for and arduous mental torture for those who never find their cup of tea. Whichever argument you are inclined towards, we must agree that reading can be a form of bargained therapy. Depending on what you read, you can help yourself to get in a better mental shape. There’s a whole new world waiting for you to witness it in every book that you may hold; dive in, swim with the mythical beings and see for yourself if the journey was worth it.",
  "author": "Jai",
  "slug": "do-we-become-what-we-read-or-do-we-read-what-we-are",
  "metadesc": "It’s kind of a pertinent question that I’ve been musing on lately. I first thought of it while I was immersed in Murakami’s Sputnik Sweetheart."
}
