{
  "title": "Open by Andre Agassi",
  "content": "With the spotlight always around the big three of tennis, the casual millennial sports enthusiast may have never heard of the name Andre Agassi. The former world no. 1 American tennis star player who is the author of this month’s book review Open. If you’re anything like me, you may have assumed that any sportsperson who has ever held the title of being the world no. 1 in his/her sports, must be a gifted individual. A former world no. 1 tennis legend wrote about his struggles throughout his professional and personal life as a tennis player in his incredibly vulnerable autobiography, Open. Open takes you through the entire lifespan of a champion, who in his own words used to “hate tennis”, the sport which earned him both the name and fame that would last long after he’s gone. Untrue to what you may think, Andre didn’t start off with an unabiding attraction to tennis. He was born in a middle class family, with a frustrated man for a father. The most distinct childhood memories that he had was of his father either yelling at him to “smash the ball harder”, or of the furious sound his incredulous bowling machine used to make. In his book, Andre opens up about his failures and losses both as a professional tennis player, and as a person growing in the limelight. Andre’s autobiography is the most interesting anti-sports book written by a superstar athlete. In his book, he was trying to put forth how the game he mastered seemed to him like a prison he wanted to escape. Labeled throughout his life as an “attention-seeker”, Andre tells us of the unforgiving nature of media when you’re always in the limelight. Although sports enthusiasts would not see Agassi as the GOAT of the game, only a few can argue that nobody stayed as much in the news as he did when he was playing. Now as a retired legend, he tries to explain the complexities and dilemmas he faced during his tennis career. The thing which I admired the most about this autobiography was how honestly it was written. Agassi didn’t try to portray himself as some godlike phenomenon who always had things under control. Instead, he talks a lot more about his failures than his achievements. He showcased himself in the most vulnerable way. For instance, he talks about a time in his life when he had hit rock-bottom and he leaned on consuming methamphetamine, and later lied about it to tennis officials to avoid a suspension. With a detailed account of his tennis career, Open also talks about Andre’s personal life. His two big-shot marriages are talked about as honestly as his tennis career. Brooke Shield, Agassi’s first wife and big Hollywood actress, lasted only a couple of years. Besides the fact that both the two lived all their life in media limelight, there was little common to each of them. After his divorce with Brooke, and a obviously dark period which entails any separation, Andre found himself pulled towards his long crush Steffi Graf. If it were not for Serena Williams, Steffi Graf would be known as the best woman tennis player of all time. Only a few people in the world could dwarf Andre’s achievements and Steffi was one of them. Each page of Open is illuminated by an incredible piece of clean and precise writing. It makes sense to name J. R. Moehringer, author of the memoir “The Tender Bar,” who helped Agassi enhance his story with an immaculate use of language. Agassi says he read Moehringer’s memoir at his last US Open and recruited him to help write his own book. The result is a memoir which not only inspires, but also illuminates the reader about the importance of hardships in one’s life. It also makes a point that not everyone who seems like an attention-seeker is seeking attention. Some are just conducting a struggle to find selfhood in a world that threatens to devour them.",
  "author": "Jai",
  "slug": "open",
  "metadesc": "With the spotlight always around the big three of tennis, the casual millennial sports enthusiast may have never heard of the name Andre Agassi."
}
